cases/cfd/fluids/cylinder_schafer_turek_2d1_cd/solution/case/Allrun
#!/usr/bin/env bash
set -eo pipefail
cd "$(dirname "$0")"
if ! command -v blockMesh >/dev/null 2>&1; then
    set +u
    source /usr/lib/openfoam/openfoam2412/etc/bashrc
    set -u
fi
blockMesh
checkMesh
simpleFoam
python3 extract_cd.py
