cases/cfd/fluids/cylinder_schafer_turek_2d1_cd/solution/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Steady laminar flow (Re = 20). No RANS model, no k/omega/nut fields.
simulationType  laminar;
